In [1]:
import pandas as pd

DEL: deletes one column only

In [4]:
data_del = pd.DataFrame(
    {'one': [1, 2, 3],
     'two': [10, 20, 30],
     'three': [100, 200, 300]}
)

del data_del["two"]
data_del

   one  three
0    1    100
1    2    200
2    3    300

POP: brings back the deleted column

In [6]:
data = pd.DataFrame(
    {'one': [1, 2, 3],
     'two': [10, 20, 30],
     'three': [100, 200, 300]}
)

two_out = data.pop("two")
two_out

0    10
1    20
2    30
Name: two, dtype: int64

DROP: deletes multiple columns

In [7]:
data = pd.DataFrame(
    {'one': [1, 2, 3],
     'two': [10, 20, 30],
     'three': [100, 200, 300]}
)

#drop one column by name, create a new object
data_new = data.drop('one', axis=1)

#drop two columns by name, create a new object
data_three = data.drop(['one', 'two'], axis=1)

#drop columns by index in-place
data.drop(data.columns[[0, 1]], axis=1, inplace=True)

data

   three
0    100
1    200
2    300

DROP: can be set to ignore errors if a column(s) doesn't exist

In [8]:
data = pd.DataFrame(
    {'one': [1, 2, 3],
     'two': [10, 20, 30],
     'three': [100, 200, 300]}
)

#raises KeyError by default if the column does not exist
#data.drop("four", axis=1, inplace=True)

#suppress error message if column does not exist
data.drop("four", axis=1, inplace=True, errors='ignore')
data

   one  two  three
0    1   10    100
1    2   20    200
2    3   30    300